base/InformationRegisters/бит_ДанныеДокументовКазначейства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ДанныеДокументовКазначейства</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_4</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_5</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_6</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_7</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_8</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_9</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_10</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_11</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика_12</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКредитовИДепозитов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыАренды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоХраненияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/Enums/бит_ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыДенежныхСредств</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
					<Comment>Наличные</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
					<Comment>Безналичные</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/InformationRegisters/бит_ДанныеДокументовКазначейства/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьКОтражениюВДанныеДокументовКазначейства(Параметры, ДокументМенеджер) Экспорт
	
	ПолноеИмяОбъекта					 = ДокументМенеджер.ПустаяСсылка().Метаданные().ПолноеИмя();
	ПараметрыВыборки 					 = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПолноеИмяОбъекта;
	ПараметрыВыборки.СпособВыборки		 = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Дата УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Дата УБЫВ");  
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	#Таблица КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка > &Ссылка";
	
	ЧтоЗаменить   = "#Таблица";
	НаЧтоЗаменить = ПолноеИмяОбъекта;
	ТекстЗапроса  = СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, НаЧтоЗаменить);
	
	ОтработаныВсеДокументы = Ложь;
	Ссылка 				   = "";

	Пока НЕ ОтработаныВсеДокументы Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		ДокументыДляОбработки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, ДокументыДляОбработки);
		
		КоличествоСсылок = ДокументыДляОбработки.Количество();
		Если КоличествоСсылок < 1000 Тогда
			ОтработаныВсеДокументы = Истина;
		КонецЕсли;
		
		Если КоличествоСсылок > 0 Тогда
			Ссылка = ДокументыДляОбработки[КоличествоСсылок - 1];
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры

// Обработчик обновления.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ОбработатьОтражениеВДанныеДокументовКазначейства(Параметры, ДокументМенеджер) Экспорт

	ОбработкаЗавершена = Истина;
	
	ИмяПроцедуры	  = "ОбработатьОтражениеВДанныеДокументовКазначейства";
	МетаданныеОбъекта = ДокументМенеджер.ПустаяСсылка().Метаданные();
	ПолноеИмяОбъекта  = МетаданныеОбъекта.ПолноеИмя();
	ПредставлениеВида = МетаданныеОбъекта.Представление();
	ВыбранныеДанные   = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;   
		
	Для Каждого Строка Из ВыбранныеДанные Цикл
		
		НачатьТранзакцию();
		Попытка
			
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.бит_ДанныеДокументовКазначейства");
			ЭлементБлокировкиДанных.УстановитьЗначение("Документ", Строка.Ссылка);
			ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Разделяемый;
			
			БлокировкаДанных.Заблокировать();
			
			ПредставлениеСсылка = Строка(Строка.Ссылка);
			
			ПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Ссылка, "ПометкаУдаления");
			Если НЕ ПометкаУдаления Тогда 	
				
				НаборЗаписей = РегистрыСведений.бит_ДанныеДокументовКазначейства.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Документ.Установить(Строка.Ссылка);
				
				Если ТипЗнч(Строка.Ссылка) = Тип("ДокументСсылка.бит_кзн_ЗаявкаНаРасходованиеСредств") Тогда
					ЗаполнитьДанныеЗаявок(НаборЗаписей, Строка.Ссылка);	
				Иначе
					ЗаполнитьДанныеПланируемыхПоступлений(НаборЗаписей, Строка.Ссылка);
				КонецЕсли;
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			КонецЕсли;
							
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Строка.Ссылка);
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			// Если не удалось обработать какой-либо документ, повторяем попытку снова.
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОшибкуВЖурналРегистрации(Строка.Ссылка, ПредставлениеСсылка, ИнформацияОбОшибке());
		КонецПопытки;
		
	КонецЦикла;
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ШаблонСообщения = НСтр("ru = 'Процедуре ""%1"" не удалось обработать некоторые документы ""%2"" (пропущены): %3'; 
								|en = 'The procedure ""%1"" failed to process some documents ""%2"" (skipped): %3'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ИмяПроцедуры, ПредставлениеВида, ПроблемныхОбъектов);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация, МетаданныеОбъекта,, ТекстСообщения);
	Иначе
		ШаблонСообщения = НСтр("ru = 'Обработана очередная порция документов ""%1"": %2';
								|en = 'The next batch of documents ""%1"" has been processed: %2'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПредставлениеВида, ОбъектовОбработано);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			МетаданныеОбъекта,, ТекстСообщения);
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДанныеЗаявок(НаборЗаписей, Ссылка)

	ИспользоватьДоговорыСПоставщиками	   = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками");
	ИспользоватьДоговорыМеждуОрганизациями = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыМеждуОрганизациями");
	ИспользоватьДоговорыСКлиентами		   = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");

	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Ссылка", 								Ссылка);
	Запрос.УстановитьПараметр("ИспользоватьДоговорыСПоставщиками", 		ИспользоватьДоговорыСПоставщиками);
	Запрос.УстановитьПараметр("ИспользоватьДоговорыМеждуОрганизациями", ИспользоватьДоговорыМеждуОрганизациями);
	Запрос.УстановитьПараметр("ИспользоватьДоговорыСКлиентами", 		ИспользоватьДоговорыСКлиентами);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(бит_кзн_ПлатежнаяПозиция.Ссылка) КАК Ссылка,
	|	СУММА(бит_кзн_ПлатежнаяПозиция.СуммаНДС) КАК СуммаНДС,
	|	СУММА(бит_кзн_ПлатежнаяПозиция.СуммаДокумента) КАК СуммаДокумента,
	|	бит_кзн_ПлатежнаяПозиция.ДокументПланирования КАК ДокументПланирования
	|ПОМЕСТИТЬ ПлатежнаяПозиция
	|ИЗ
	|	Документ.бит_кзн_ПлатежнаяПозиция КАК бит_кзн_ПлатежнаяПозиция
	|ГДЕ
	|	бит_кзн_ПлатежнаяПозиция.ДокументПланирования = &Ссылка
	|	И НЕ бит_кзн_ПлатежнаяПозиция.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_кзн_ПлатежнаяПозиция.ДокументПланирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.ДокументПланирования КАК ДокументПланирования,
	|	Реквизиты.ДокументПланирования КАК Документ,
	|	Реквизиты.ЦФО КАК ЦФО,
	|	Реквизиты.СтатьяОборотов КАК СтатьяОборотов,
	|	Реквизиты.Аналитика_1 КАК Аналитика_1,
	|	Реквизиты.Аналитика_2 КАК Аналитика_2,
	|	Реквизиты.Аналитика_3 КАК Аналитика_3,
	|	Реквизиты.Аналитика_4 КАК Аналитика_4,
	|	Реквизиты.Аналитика_5 КАК Аналитика_5,
	|	Реквизиты.Аналитика_6 КАК Аналитика_6,
	|	Реквизиты.Аналитика_7 КАК Аналитика_7,
	|	Реквизиты.Аналитика_8 КАК Аналитика_8,
	|	Реквизиты.Аналитика_9 КАК Аналитика_9,
	|	Реквизиты.Аналитика_10 КАК Аналитика_10,
	|	Реквизиты.Аналитика_11 КАК Аналитика_11,
	|	Реквизиты.Аналитика_12 КАК Аналитика_12,
	|	Реквизиты.ДатаПлан КАК ДатаПлан,
	|	Реквизиты.ПометкаУдаления КАК ПометкаУдаления,
	|	ПлатежнаяПозиция.СуммаДокумента КАК Сумма,
	|	ПлатежнаяПозиция.СуммаНДС КАК НДС,
	|	ВЫБОР
	|		КОГДА Реквизиты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеНаДепозиты)
	|				ИЛИ Реквизиты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийКазначейства.ОплатаПоКредитам)
	|				ИЛИ Реквизиты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеНаДепозиты)
	|				ИЛИ Реквизиты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийКазначейства.ВыдачаЗаймов)
	|			ТОГДА Реквизиты.ДоговорКредитаДепозита
	|		КОГДА Реквизиты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийКазначейства.ОплатаПоКредитам)
	|			ТОГДА Реквизиты.ДоговорАренды
	|		КОГДА Реквизиты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийКазначейства.ВозвратДенежныхСредствВДругуюОрганизацию)
	|					И &ИспользоватьДоговорыМеждуОрганизациями
	|				ИЛИ Реквизиты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийКазначейства.ВозвратОплатыКлиенту)
	|					И &ИспользоватьДоговорыСКлиентами
	|				ИЛИ Реквизиты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийКазначейства.ОплатаПоставщику)
	|					И &ИспользоватьДоговорыСПоставщиками
	|				ИЛИ Реквизиты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийКазначейства.ОплатаДенежныхСредствВДругуюОрганизацию)
	|					И &ИспользоватьДоговорыМеждуОрганизациями
	|				ИЛИ Реквизиты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийКазначейства.ПеречислениеТаможне)
	|					И &ИспользоватьДоговорыСПоставщиками
	|			ТОГДА Реквизиты.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА Реквизиты.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.бит_ВидыДенежныхСредств.Наличные)
	|			ТОГДА Реквизиты.Касса
	|		ИНАЧЕ Реквизиты.БанковскийСчет
	|	КОНЕЦ КАК МестоХраненияДенежныхСредств,
	|	Реквизиты.Подразделение КАК Подразделение
	|ИЗ
	|	ПлатежнаяПозиция КАК ПлатежнаяПозиция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_кзн_ПлатежнаяПозиция КАК Реквизиты
	|		ПО ПлатежнаяПозиция.Ссылка = Реквизиты.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если ЗначениеЗаполнено(РезультатЗапроса) Тогда
		Реквизиты = РезультатЗапроса[0];
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Реквизиты);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПланируемыхПоступлений(НаборЗаписей, Ссылка)

	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_кзн_ПозицияПоступления.ДокументПланирования КАК ДокументПланирования,
	|	МАКСИМУМ(бит_кзн_ПозицияПоступления.Ссылка) КАК Позиция,
	|	СУММА(бит_кзн_ПозицияПоступления.СуммаНДС) КАК СуммаНДС,
	|	СУММА(бит_кзн_ПозицияПоступления.СуммаДокумента) КАК СуммаДокумента
	|ПОМЕСТИТЬ ПозицияПоступления
	|ИЗ
	|	Документ.бит_кзн_ПозицияПоступления КАК бит_кзн_ПозицияПоступления
	|ГДЕ
	|	бит_кзн_ПозицияПоступления.ДокументПланирования = &Ссылка
	|	И НЕ бит_кзн_ПозицияПоступления.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_кзн_ПозицияПоступления.ДокументПланирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.ДокументПланирования КАК ДокументПланирования,
	|	Реквизиты.ДокументПланирования КАК Документ,
	|	Реквизиты.ЦФО КАК ЦФО,
	|	Реквизиты.СтатьяОборотов КАК СтатьяОборотов,
	|	Реквизиты.Аналитика_1 КАК Аналитика_1,
	|	Реквизиты.Аналитика_2 КАК Аналитика_2,
	|	Реквизиты.Аналитика_3 КАК Аналитика_3,
	|	Реквизиты.Аналитика_4 КАК Аналитика_4,
	|	Реквизиты.Аналитика_5 КАК Аналитика_5,
	|	Реквизиты.Аналитика_6 КАК Аналитика_6,
	|	Реквизиты.Аналитика_7 КАК Аналитика_7,
	|	Реквизиты.Аналитика_8 КАК Аналитика_8,
	|	Реквизиты.Аналитика_9 КАК Аналитика_9,
	|	Реквизиты.Аналитика_10 КАК Аналитика_10,
	|	Реквизиты.Аналитика_11 КАК Аналитика_11,
	|	Реквизиты.Аналитика_12 КАК Аналитика_12,
	|	Реквизиты.ДатаПлан КАК ДатаПлан,
	|	Реквизиты.ПометкаУдаления КАК ПометкаУдаления,
	|	ПозицияПоступления.СуммаДокумента КАК Сумма,
	|	ПозицияПоступления.СуммаНДС КАК НДС,
	|	Реквизиты.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА Реквизиты.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.бит_ВидыДенежныхСредств.Наличные)
	|			ТОГДА Реквизиты.Касса
	|		ИНАЧЕ Реквизиты.БанковскийСчет
	|	КОНЕЦ КАК МестоХраненияДенежныхСредств,
	|	Реквизиты.Подразделение КАК Подразделение
	|ИЗ
	|	ПозицияПоступления КАК ПозицияПоступления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_кзн_ПозицияПоступления КАК Реквизиты
	|		ПО ПозицияПоступления.Позиция = Реквизиты.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если ЗначениеЗаполнено(РезультатЗапроса) Тогда
		Реквизиты = РезультатЗапроса[0];
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Реквизиты);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
